<a href="https://colab.research.google.com/github/mariuszkr33/dw_matrix/blob/master/sklearn1.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import sklearn
sklearn.__version__

'0.22.2.post1'

In [ ]:
import numpy as np
import pandas as pd


data = {
    'size': ['XL', 'L', 'M', np.nan, 'M', 'M'],
    'color': ['red', 'green', 'blue', 'green', 'red', 'green'],
    'gender': ['female', 'male', np.nan, 'female', 'female', 'male'],
    'price': [199.0, 89.0, np.nan, 129.0, 79.0, 89.0],
    'weight': [500, 450, 300, np.nan, 410, np.nan],
    'bought': ['yes', 'no', 'yes', 'no', 'yes', 'no']
}

In [ ]:
df = pd.DataFrame(data)
df

  size  color  gender  price  weight bought
0   XL    red  female  199.0   500.0    yes
1    L  green    male   89.0   450.0     no
2    M   blue     NaN    NaN   300.0    yes
3  NaN  green  female  129.0     NaN     no
4    M    red  female   79.0   410.0    yes
5    M  green    male   89.0     NaN     no

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   size    5 non-null      object
 1   color   6 non-null      object
 2   gender  5 non-null      object
 3   price   5 non-null      float64
 4   weight  4 non-null      float64
 5   bought  6 non-null      object
dtypes: float64(2), object(4)
memory usage: 416.0+ bytes

In [ ]:
np.round(df.isnull().sum()/len(df),2)

size      0.17
color     0.00
gender    0.17
price     0.17
weight    0.33
bought    0.00
dtype: float64

In [ ]:
from sklearn.impute import SimpleImputer

In [ ]:
imputer = SimpleImputer(np.nan,'mean')
df[['weight']] = imputer.fit_transform(df[['weight']])
df

  size  color  gender  price  weight bought
0   XL    red  female  199.0   500.0    yes
1    L  green    male   89.0   450.0     no
2    M   blue     NaN    NaN   300.0    yes
3  NaN  green  female  129.0   415.0     no
4    M    red  female   79.0   410.0    yes
5    M  green    male   89.0   415.0     no

In [ ]:
imputer.statistics_[0]

415.0

In [ ]:
imputer = SimpleImputer(np.nan, strategy='constant', fill_value=99.0)
df[['price']] = imputer.fit_transform(df[['price']])
df

  size  color  gender  price  weight bought
0   XL    red  female  199.0   500.0    yes
1    L  green    male   89.0   450.0     no
2    M   blue     NaN   99.0   300.0    yes
3  NaN  green  female  129.0   415.0     no
4    M    red  female   79.0   410.0    yes
5    M  green    male   89.0   415.0     no

In [ ]:
imputer = SimpleImputer(missing_values=np.nan, strategy='most_frequent')
df[['size']] = imputer.fit_transform(df[['size']])
df

  size  color  gender  price  weight bought
0   XL    red  female  199.0   500.0    yes
1    L  green    male   89.0   450.0     no
2    M   blue     NaN   99.0   300.0    yes
3    M  green  female  129.0   415.0     no
4    M    red  female   79.0   410.0    yes
5    M  green    male   89.0   415.0     no

In [ ]:
df = pd.DataFrame(data)
df

  size  color  gender  price  weight bought
0   XL    red  female  199.0   500.0    yes
1    L  green    male   89.0   450.0     no
2    M   blue     NaN    NaN   300.0    yes
3  NaN  green  female  129.0     NaN     no
4    M    red  female   79.0   410.0    yes
5    M  green    male   89.0     NaN     no

In [ ]:
df = df.dropna()
df

  size  color  gender  price  weight bought
0   XL    red  female  199.0   500.0    yes
1    L  green    male   89.0   450.0     no
4    M    red  female   79.0   410.0    yes

In [ ]:
df['price'].mean()

122.33333333333333

In [ ]:
df['weight'].mean()

453.3333333333333

In [ ]:
print(df['price'].mean())

122.33333333333333

In [ ]:
print(df[~df['weight'].isnull()].mean())

price     122.333333
weight    453.333333
dtype: float64

In [ ]:
df[~df['weight'].isnull()].mean()

price     122.333333
weight    453.333333
dtype: float64

In [ ]:
df_object = df.select_dtypes(include='object').fillna('empty')
df_object

  size  color  gender bought
0   XL    red  female    yes
1    L  green    male     no
4    M    red  female    yes

In [ ]:
import pandas as pd


df = pd.DataFrame(data={'weight': [75., 78.5, 85., 91., 84.5, 83., 68.]})

In [ ]:
df

   weight
0    75.0
1    78.5
2    85.0
3    91.0
4    84.5
5    83.0
6    68.0

In [ ]:
df['weight_cut'] = pd.cut(df['weight'], bins =3)
df

   weight        weight_cut
0    75.0  (67.977, 75.667]
1    78.5  (75.667, 83.333]
2    85.0    (83.333, 91.0]
3    91.0    (83.333, 91.0]
4    84.5    (83.333, 91.0]
5    83.0  (75.667, 83.333]
6    68.0  (67.977, 75.667]

In [ ]:
df['weight_cut_2'] = pd.cut(df['weight'], bins =(60,75,80,95))
df

   weight        weight_cut weight_cut_2
0    75.0  (67.977, 75.667]     (60, 75]
1    78.5  (75.667, 83.333]     (75, 80]
2    85.0    (83.333, 91.0]     (80, 95]
3    91.0    (83.333, 91.0]     (80, 95]
4    84.5    (83.333, 91.0]     (80, 95]
5    83.0  (75.667, 83.333]     (80, 95]
6    68.0  (67.977, 75.667]     (60, 75]

In [ ]:
df['weight_cut_3'] = pd.cut(df['weight'], bins =(60,75,80,95), labels=['small', 'medium', 'high'])
df

   weight        weight_cut weight_cut_2 weight_cut_3
0    75.0  (67.977, 75.667]     (60, 75]        small
1    78.5  (75.667, 83.333]     (75, 80]       medium
2    85.0    (83.333, 91.0]     (80, 95]         high
3    91.0    (83.333, 91.0]     (80, 95]         high
4    84.5    (83.333, 91.0]     (80, 95]         high
5    83.0  (75.667, 83.333]     (80, 95]         high
6    68.0  (67.977, 75.667]     (60, 75]        small